x1=15000;      % 购买价格
x2=19000;      % 出售价格
x3=x1-x2;      % 差价
s=80;          % 房屋面积
%------------------------------------------------------
a=0.0565;      % 营业税税率
b=0.0005;      % 印花税税率
c=0.1;         % 附加税税率
d=0.2;         % 个人所得税税率


%-----------------------------------------------------
x4=a*x2;       % 营业税
x5=b*x2;       % 印花税
x6=c*x4;       % 附加税
x7=d*(x2-x1-x4-x5-x6); %个人所得税
x8=x4+x5+x6+x7
y=x2-x1-x8;   %收益单价
%--------------------------------------------------
y1=(x4+x5+x6+x7)*s/10000
y2=y*s/10000        % 总收益 %按Ctrl + Enter 运行
%%
x1=10000;      % 购买价格
%x2=15000;      % 出售价格
x3=x1-x2;      % 差价
s=70;          % 房屋面积
%------------------------------------------------------
a=0.0565;      % 营业税税率
b=0.0005;      % 印花税税率
c=0.1;         % 附加税税率
d=0.2;         % 个人所得税税率



%-----------------------------------------------------
x4=a*x2;       % 营业税
x5=b*x2;       % 印花税
x6=c*x4;       % 附加税
x7=d*(x2-x1-x4-x5-x6); %个人所得税
y=x2-x1-x4-x5-x6-x7;   %收益单价
%--------------------------------------------------
figure(1)
x2=x1-5000:1:x1+10000;
x3=-5000:1:10000;
y=x3-x4-x5-x6-x7;   %收益单价
y1=y*s;         % 总收益
figure(1)
set(0,'defaultfigurecolor','w');
plot(x2,y1,'blue -^'); %收益随出售价的变化图
legend('收益随出售价的变化图');
figure(2)
set(0,'defaultfigurecolor','w');
plot(x3,y1,'blue -^'); %收益随出售价的变化图
legend('收益随差价的变化图');
%%
%%
%x1=10000;      % 购买价格
%x2=15000;      % 出售价格
x1=5000:10:24000;
x2=5000:10:24000;
%x3=x1-x2;      % 差价
s=70;          % 房屋面积
%------------------------------------------------------
a=0.0565;      % 营业税税率
b=0.0005;      % 印花税税率
c=0.1;         % 附加税税率
d=0.2;         % 个人所得税税率
%-----------------------------------------------------
x4=a*x2;       % 营业税
x5=b*x2;       % 印花税
x6=c*x4;       % 附加税
x7=d*(x2-x1-x4-x5-x6); %个人所得税
y=x2-x1-x4-x5-x6-x7;   %收益单价
%--------------------------------------------------
y=x1-x2-x4-x5-x6-x7;   %收益单价
y1=y*s;             % 总收益
Z=y1;
set(0,'defaultfigurecolor','w');
plot3(x1,x2,y1); %收益随出售价的变化图
legend('收益随差价的变化图');







